6/4D/first_routes_and_controllers/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Mona Lisa"], ["image_url", "url goes here"], ["artist_id", 1]]
---
    def create
      artwork = Artwork.new(artwork_data)
      if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1 WHERE "artworks"."id" = $2  [["artist_id", 4], ["id", 2]]
---
    def update
        artwork = Artwork.find(params[:id])
        artwork.update(artwork_data)