6/4D/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

  def index
        artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create
      artwork_share = ArtworkShare.new(artwork_share_data)
      if artwork_share.save
---
INSERT INTO "artwork_shares" ("created_at", "updated_at", "artwork_id", "viewer_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2020-05-14 18:18:19.241008"], ["updated_at", "2020-05-14 18:18:19.241008"], ["artwork_id", 2], ["viewer_id", 4]]