6/4D/first_routes_and_controllers/app/controllers/comments_controller.rb

    def index
        if params[:user_id]
            source = User.find(params[:user_id])
        elsif params[:artwork_id]
            source = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]