6/4D/first_routes_and_controllers/app/controllers/likes_controller.rb

  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      render json: user.liked_comments + user.liked_artworks
    elsif params[:comment_id]
        comment = Comment.find(params[:comment_id])
        render json: comment.user_likes
    elsif params[:artwork_id]
        artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]