6/4D/first_routes_and_controllers/app/controllers/users_controller.rb

    def index
      render json: User.find(params[:id]) if params[:id]
      users = User.all
---
SELECT "users".* FROM "users"

    def create
      # debugger
      user = User.new(user_data)
      if user.save #difference between .save and .save! save! fails loudly and wont let program continue
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Andrew"], ["email", "andrew@gmail.com"], ["created_at", "2020-05-13 23:17:07.643682"], ["updated_at", "2020-05-13 23:17:07.643682"]]

    def update
        user = User.find(params[:id])
        user.update(user_data)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "andrew1@gmail.com"], ["updated_at", "2020-05-13 23:38:23.589355"], ["id", 3]]